#!/usr/bin/python3.5

# 1. 实现1-100的所有的和
# 2. 实现1-500所有奇数的和
# 3. 求1+ 2! + 3! + 4! + ……20！的和
# 4. 对指定一个list进行排序[2,32,43,453,54,6,576,5,7,6,8,78,7,89]

#1. 实现1-100的所有的和

n = 0
for i in range(1,101):
    n += i
print(n)


#2. 实现1-500所有奇数的和

n = 0
for i in range(1,501):
    if i % 2 == 0 :
        continue
    if i % 2 == 1 :
        n += i
print(n)


# 3. 求1+ 2! + 3! + 4! + ……20！的和

sum = 0
n = 1
for i in range(1,21):
    n *= i
    sum += n
print(sum)


# 4. 对指定一个list进行排序[2,32,43,453,54,6,576,5,7,6,8,78,7,89]

a = [2,32,43,453,54,6,576,5,7,6,8,78,7,89]
a.sort()
print(a)







